#ifndef UE4SS_SDK_ABP_HDPlayerCharacter_FP_HPP
#define UE4SS_SDK_ABP_HDPlayerCharacter_FP_HPP

class UABP_HDPlayerCharacter_FP_C : public UHDPlayerCharacterAnimInst_FPP
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02E0 (size: 0x8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_31;                           // 0x02E8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17;                         // 0x0310 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_30;                           // 0x03C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x03F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x0418 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_15;                               // 0x0440 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16;                         // 0x0508 (size: 0xB8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_17;                     // 0x05C0 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x0680 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_16;                     // 0x06A8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x0768 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_15;                     // 0x0790 (size: 0xC0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_14;                     // 0x0850 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x0910 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x09C8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x09F0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x0A18 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_13;                     // 0x0A40 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x0B00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x0B28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x0B50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x0B78 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_48;                         // 0x0BA0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x0C18 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_47;                         // 0x0C48 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x0CC0 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x0CF0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x0D20 (size: 0xB0)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x0DD0 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0x0E00 (size: 0xE0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_46;                         // 0x0EE0 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_14;                               // 0x0F58 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x1020 (size: 0xB8)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_13;                               // 0x10D8 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x11A0 (size: 0x28)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x11C8 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_12;                               // 0x1278 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x1340 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x13F8 (size: 0x78)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_8;                            // 0x1470 (size: 0xC8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x1538 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x15F0 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_12;                     // 0x1618 (size: 0xC0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24;                                 // 0x16D8 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;     // 0x17E0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;     // 0x1800 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23;                                 // 0x1820 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_7;                                      // 0x1928 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_6;                                      // 0x1A18 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;     // 0x1B08 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;     // 0x1B28 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22;                                 // 0x1B48 (size: 0x108)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_8;                                   // 0x1C50 (size: 0x18)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x1C68 (size: 0xA0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x1D08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x1D30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x1D58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x1D80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x1DA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x1DD0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x1DF8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x1E70 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x1EA0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x1F18 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x1F48 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x1FC0 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_7;                                   // 0x1FF0 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x2008 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x2038 (size: 0xB0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_7;                            // 0x20E8 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21;                                 // 0x21B0 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;     // 0x22B8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;     // 0x22D8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x22F8 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_11;                               // 0x2370 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x2438 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x24B0 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_10;                               // 0x2528 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x25F0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x2668 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x26E0 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_9;                                // 0x2758 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x2820 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_8;                                // 0x2898 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x2960 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x29D8 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_7;                                // 0x2A50 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x2B18 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x2B90 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x2C30 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x2CD0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x2D48 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_6;                                // 0x2DC0 (size: 0xC8)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_6;                                   // 0x2E88 (size: 0x18)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_5;                                   // 0x2EA0 (size: 0x18)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x2EB8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x2EE8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x2F10 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x2F38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x2F60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x2F88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x2FB0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x2FD8 (size: 0x78)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_6;                            // 0x3050 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x3118 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_11;                     // 0x3140 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x3200 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x3278 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x32A8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x32D0 (size: 0x78)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_5;                            // 0x3348 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_10;                     // 0x3410 (size: 0xC0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x34D0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x3548 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x3578 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x35A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x35D0 (size: 0xB0)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x3680 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x36F8 (size: 0xB8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_9;                      // 0x37B0 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x3870 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x3898 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x38C8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x3940 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x3970 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x3A20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x3A48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x3A70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x3A98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x3AC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x3AE8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x3B10 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x3B88 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x3BB8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x3C30 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x3C60 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x3CD8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x3D08 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x3D80 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x3DB0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x3E28 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x3E58 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x3ED0 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x3F48 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x3FE8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x4018 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x40C8 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x4180 (size: 0xB8)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x4238 (size: 0xB0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x42E8 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x4310 (size: 0xB8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x43C8 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x43E8 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_8;                      // 0x4410 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x44D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x44F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x4520 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x4548 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x4570 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x45E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x4618 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x4690 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x4730 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x4758 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x4788 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x4800 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x4830 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x4858 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x4888 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x4938 (size: 0xB8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x49F0 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x4AB0 (size: 0xB8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x4B68 (size: 0x20)
    char padding_0[0x8];                                                              // 0x4B88 (size: 0x8)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x4B90 (size: 0x1E0)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x4D70 (size: 0x1E0)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x4F50 (size: 0x78)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20;                                 // 0x4FC8 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x50D0 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x50F0 (size: 0x78)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19;                                 // 0x5168 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x5270 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_5;                                      // 0x5290 (size: 0xF0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0x5380 (size: 0xB8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x5438 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x5458 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x5518 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_4;                                      // 0x5540 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18;                                 // 0x5630 (size: 0x108)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x5738 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0x57B0 (size: 0xB8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17;                                 // 0x5868 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x5970 (size: 0x20)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0x5990 (size: 0xB0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16;                                 // 0x5A40 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15;                                 // 0x5B48 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x5C50 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x5C78 (size: 0xC0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x5D38 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x5D60 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x5D88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x5DB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x5DD8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0x5E00 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0x5E28 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0x5E50 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0x5E78 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0x5EA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0x5EC8 (size: 0x28)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0x5EF0 (size: 0xE0)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_4;                                   // 0x5FD0 (size: 0x18)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x5FE8 (size: 0xC0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0x60A8 (size: 0xE0)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_3;                                   // 0x6188 (size: 0x18)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x61A0 (size: 0xC0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_5;                                // 0x6260 (size: 0xC8)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_2;                                   // 0x6328 (size: 0x18)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0x6340 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x63F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x6420 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x6498 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_4;                                // 0x6510 (size: 0xC8)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x65D8 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_3;                                // 0x6608 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x66D0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x6748 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0x67C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x67F0 (size: 0x78)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x6868 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x6930 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0x69A8 (size: 0x30)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x69D8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x6AA0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x6B18 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0x6B90 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x6BC0 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0x6BD8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x6C08 (size: 0xB0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14;                                 // 0x6CB8 (size: 0x108)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0x6DC0 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0x6E38 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x6EF0 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x6F18 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x6F40 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x6F60 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0x6F80 (size: 0xC8)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x7048 (size: 0xF0)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x7138 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x7158 (size: 0xF0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x7248 (size: 0x20)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x7268 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0x7290 (size: 0xB8)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x7348 (size: 0x48)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x7390 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13;                                 // 0x7458 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x7560 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x7668 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x7728 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0x7750 (size: 0xB8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x7808 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x78C8 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x78F0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x79F8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x7B00 (size: 0x108)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x7C08 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x7CD0 (size: 0x78)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x7D48 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0x7D70 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x7D98 (size: 0xC8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x7E60 (size: 0x108)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0x7F68 (size: 0xB0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0x8018 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x8040 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x8148 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x8250 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x8358 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0x8418 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0x8440 (size: 0xB0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x84F0 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x85E0 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x86D0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x87D8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x88E0 (size: 0x108)
    char padding_1[0x8];                                                              // 0x89E8 (size: 0x8)
    FAnimNode_LookAt AnimGraphNode_LookAt;                                            // 0x89F0 (size: 0x1B0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0x8BA0 (size: 0xB8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0x8C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0x8C80 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0x8CA8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0x8D20 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0x8D50 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0x8DC8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0x8DF8 (size: 0xB0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x8EA8 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x8FB0 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x8FD0 (size: 0x20)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose;                                     // 0x8FF0 (size: 0x18)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x9008 (size: 0xA0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x90A8 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0x9148 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x9170 (size: 0x108)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0x9278 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0x92A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0x92D0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0x92F8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0x9370 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x93A0 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0x93B8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0x93E8 (size: 0xB0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x9498 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0x9560 (size: 0x78)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x95D8 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0x96A0 (size: 0x78)
    class ABP_HDPlayerCharacterBase_C* OwningChar;                                    // 0x9718 (size: 0x8)
    class ABP_HDPlayerControllerBase_C* OwningPC;                                     // 0x9720 (size: 0x8)
    class UAnimSequenceBase* BasePoseAnim;                                            // 0x9728 (size: 0x8)
    class UAnimSequenceBase* IdleAdditiveAnim;                                        // 0x9730 (size: 0x8)
    class UAnimSequenceBase* MoveAnim;                                                // 0x9738 (size: 0x8)
    class UAnimSequenceBase* AimInAnim;                                               // 0x9740 (size: 0x8)
    class UAnimSequenceBase* AimBasePoseAnim;                                         // 0x9748 (size: 0x8)
    class UAnimSequenceBase* AimOutAnim;                                              // 0x9750 (size: 0x8)
    class UAnimSequenceBase* SprintInAnim;                                            // 0x9758 (size: 0x8)
    class UAnimSequenceBase* SprintAnim;                                              // 0x9760 (size: 0x8)
    class UAnimSequenceBase* SprintOutAnim;                                           // 0x9768 (size: 0x8)
    TMap<TSoftClassPtr<ADFBaseItem>, int32> WeaponAnims;                              // 0x9770 (size: 0x50)
    class UAnimSequenceBase* ProneInAnim;                                             // 0x97C0 (size: 0x8)
    class UAnimSequenceBase* CrawlAnim;                                               // 0x97C8 (size: 0x8)
    class UAnimSequenceBase* ProneOutAnim;                                            // 0x97D0 (size: 0x8)
    class UAnimSequenceBase* AimWalkAnim;                                             // 0x97D8 (size: 0x8)
    bool bPrefiring;                                                                  // 0x97E0 (size: 0x1)
    bool bReadyToThrow;                                                               // 0x97E1 (size: 0x1)
    bool bFiring;                                                                     // 0x97E2 (size: 0x1)
    char padding_2[0x5];                                                              // 0x97E3 (size: 0x5)
    class UAnimSequenceBase* ThrowReadyBasePose;                                      // 0x97E8 (size: 0x8)
    class UAnimSequenceBase* ThrowAnim;                                               // 0x97F0 (size: 0x8)
    class ABP_HDWeaponBase_C* CurrentWeapon;                                          // 0x97F8 (size: 0x8)
    bool bLeaningLeft;                                                                // 0x9800 (size: 0x1)
    bool bLeaningRight;                                                               // 0x9801 (size: 0x1)
    ELeanDirection LeanDirection;                                                     // 0x9802 (size: 0x1)
    bool bHideArmsWhileSwimming;                                                      // 0x9803 (size: 0x1)
    float LeanAmount;                                                                 // 0x9804 (size: 0x4)
    float LeanAlpha;                                                                  // 0x9808 (size: 0x4)
    float DeltaTimeX;                                                                 // 0x980C (size: 0x4)
    float LeanOffsetAlpha;                                                            // 0x9810 (size: 0x4)
    FRotator LeanRootRot;                                                             // 0x9814 (size: 0xC)
    FVector LeanWeaponOffset;                                                         // 0x9820 (size: 0xC)
    float LeanOffsetInterpSpeed;                                                      // 0x982C (size: 0x4)
    FRotator LeanWeaponRot;                                                           // 0x9830 (size: 0xC)
    FVector SmoothCrouchWeaponOffset;                                                 // 0x983C (size: 0xC)
    FRotator SmoothRotation;                                                          // 0x9848 (size: 0xC)
    float SmoothRotationAmount;                                                       // 0x9854 (size: 0x4)
    float ElbowIKWeight;                                                              // 0x9858 (size: 0x4)
    float MovementAlpha;                                                              // 0x985C (size: 0x4)
    FVector SmoothMovement;                                                           // 0x9860 (size: 0xC)
    float MaxSpeed;                                                                   // 0x986C (size: 0x4)
    FVector SmoothMovementSwizzled;                                                   // 0x9870 (size: 0xC)
    FRotator SmoothMovementRotation;                                                  // 0x987C (size: 0xC)
    float SmoothMovementRotationAlpha;                                                // 0x9888 (size: 0x4)
    float SmoothMovementRotationAmount;                                               // 0x988C (size: 0x4)
    float MovementSwayAlpha;                                                          // 0x9890 (size: 0x4)
    float AimAlpha;                                                                   // 0x9894 (size: 0x4)
    float AimSpeed;                                                                   // 0x9898 (size: 0x4)
    FVector SightDirection;                                                           // 0x989C (size: 0xC)
    FVector SightOffset;                                                              // 0x98A8 (size: 0xC)
    float RestoreGunBonePosition;                                                     // 0x98B4 (size: 0x4)
    FRotator KickRotation;                                                            // 0x98B8 (size: 0xC)
    FVector KickOffset;                                                               // 0x98C4 (size: 0xC)
    float SmoothKick;                                                                 // 0x98D0 (size: 0x4)
    float KickAmount;                                                                 // 0x98D4 (size: 0x4)
    float KickNoiseSpeed;                                                             // 0x98D8 (size: 0x4)
    float KickNoiseAmount;                                                            // 0x98DC (size: 0x4)
    float Kick;                                                                       // 0x98E0 (size: 0x4)
    FVector SightOffsetLocal;                                                         // 0x98E4 (size: 0xC)
    float SightTiltOffset;                                                            // 0x98F0 (size: 0x4)
    FVector SwayOffset;                                                               // 0x98F4 (size: 0xC)
    FVector PositionOffset;                                                           // 0x9900 (size: 0xC)
    FVector GripPosition;                                                             // 0x990C (size: 0xC)
    FRotator GripRotation;                                                            // 0x9918 (size: 0xC)
    float GripAlpha;                                                                  // 0x9924 (size: 0x4)
    bool bHasGrip;                                                                    // 0x9928 (size: 0x1)
    char padding_3[0x3];                                                              // 0x9929 (size: 0x3)
    FVector CorrectiveShoulderOffset;                                                 // 0x992C (size: 0xC)
    float MovementAmount;                                                             // 0x9938 (size: 0x4)
    float SmoothMovementAmount;                                                       // 0x993C (size: 0x4)
    float MountAlpha;                                                                 // 0x9940 (size: 0x4)
    FVector MountPosition;                                                            // 0x9944 (size: 0xC)
    FVector MountOffset;                                                              // 0x9950 (size: 0xC)
    FVector MountWeaponPosition;                                                      // 0x995C (size: 0xC)
    FRotator SightTiltRotation;                                                       // 0x9968 (size: 0xC)
    float StanceADS Weight;                                                           // 0x9974 (size: 0x4)
    bool bBracedAim;                                                                  // 0x9978 (size: 0x1)
    char padding_4[0x3];                                                              // 0x9979 (size: 0x3)
    FVector BracedAimPosition;                                                        // 0x997C (size: 0xC)
    float KickRotationAmount;                                                         // 0x9988 (size: 0x4)
    bool bHasBipod;                                                                   // 0x998C (size: 0x1)
    char padding_5[0x3];                                                              // 0x998D (size: 0x3)
    FCharacterAnimCollection WeapArmsFPPAnims;                                        // 0x9990 (size: 0x128)
    FRotator BracedAimRotation;                                                       // 0x9AB8 (size: 0xC)
    bool bDoLowReady;                                                                 // 0x9AC4 (size: 0x1)
    char padding_6[0x3];                                                              // 0x9AC5 (size: 0x3)
    FRotator LowReadyRotationOffset;                                                  // 0x9AC8 (size: 0xC)
    FVector LowReadyPositionOffset;                                                   // 0x9AD4 (size: 0xC)
    float LowReadyAlpha;                                                              // 0x9AE0 (size: 0x4)
    bool bVaulting;                                                                   // 0x9AE4 (size: 0x1)
    EVaultBehavior VaultBehavior;                                                     // 0x9AE5 (size: 0x1)
    bool bSprintVault;                                                                // 0x9AE6 (size: 0x1)
    bool bVaultOver;                                                                  // 0x9AE7 (size: 0x1)
    bool bClimbOnto;                                                                  // 0x9AE8 (size: 0x1)
    char padding_7[0x3];                                                              // 0x9AE9 (size: 0x3)
    float VaultLeftHandOffsetAlpha;                                                   // 0x9AEC (size: 0x4)
    bool bReloadNotifyState;                                                          // 0x9AF0 (size: 0x1)
    bool bSafeTriggerFinger;                                                          // 0x9AF1 (size: 0x1)
    EItemType ItemType;                                                               // 0x9AF2 (size: 0x1)
    ESpecificItemType SpecificItemType;                                               // 0x9AF3 (size: 0x1)
    float BracedAimAlpha;                                                             // 0x9AF4 (size: 0x4)
    float InverseAimAlpha;                                                            // 0x9AF8 (size: 0x4)
    float ProneHandOffsetAlpha;                                                       // 0x9AFC (size: 0x4)
    bool bProneNotifyState;                                                           // 0x9B00 (size: 0x1)
    bool bLandBasedMovement;                                                          // 0x9B01 (size: 0x1)
    char padding_8[0x2];                                                              // 0x9B02 (size: 0x2)
    float SprintAlpha;                                                                // 0x9B04 (size: 0x4)
    bool bDoSprintPistolOffset;                                                       // 0x9B08 (size: 0x1)
    bool bDoCrawlingReloadOffset;                                                     // 0x9B09 (size: 0x1)
    bool bDoCrawlingHandOffset;                                                       // 0x9B0A (size: 0x1)
    char padding_9[0x1];                                                              // 0x9B0B (size: 0x1)
    float CrawlingHandOffsetAlpha;                                                    // 0x9B0C (size: 0x4)
    float CrawlingAlpha;                                                              // 0x9B10 (size: 0x4)
    float CrawlingPlayRateSideWays;                                                   // 0x9B14 (size: 0x4)
    class UBlendSpaceBase* EquipmentBlendspaceToUse;                                  // 0x9B18 (size: 0x8)
    class UBlendSpaceBase* ThrowableBlendspaceToUse;                                  // 0x9B20 (size: 0x8)
    float IdleAnimPlayRateToUse;                                                      // 0x9B28 (size: 0x4)
    FVector MuzzleOffsetLocation;                                                     // 0x9B2C (size: 0xC)
    float WeaponTransformWeight;                                                      // 0x9B38 (size: 0x4)
    float HandIKWeightL;                                                              // 0x9B3C (size: 0x4)
    bool bEnableLeftHandIK;                                                           // 0x9B40 (size: 0x1)
    bool bFalling;                                                                    // 0x9B41 (size: 0x1)
    bool bJumping;                                                                    // 0x9B42 (size: 0x1)
    bool bSwimming;                                                                   // 0x9B43 (size: 0x1)
    float ProneMoveDirectionDeg;                                                      // 0x9B44 (size: 0x4)
    float WeaponBoundsYForward;                                                       // 0x9B48 (size: 0x4)
    float WeaponCollisionAlpha;                                                       // 0x9B4C (size: 0x4)
    FVector WeaponCollisionPos;                                                       // 0x9B50 (size: 0xC)
    FRotator WeaponCollisionRotator;                                                  // 0x9B5C (size: 0xC)
    bool bWeaponCollisionHit;                                                         // 0x9B68 (size: 0x1)
    char padding_10[0x3];                                                             // 0x9B69 (size: 0x3)
    float CrawlingPlayRateForward;                                                    // 0x9B6C (size: 0x4)
    float CrawlingLocoBlend;                                                          // 0x9B70 (size: 0x4)
    bool bCrawlingLocoDirection;                                                      // 0x9B74 (size: 0x1)
    bool bFireModeChanged;                                                            // 0x9B75 (size: 0x1)
    char padding_11[0x2];                                                             // 0x9B76 (size: 0x2)
    float FireSelectAlpha;                                                            // 0x9B78 (size: 0x4)
    bool bIsM26;                                                                      // 0x9B7C (size: 0x1)
    bool bIsBandage;                                                                  // 0x9B7D (size: 0x1)
    char padding_12[0x2];                                                             // 0x9B7E (size: 0x2)
    float SwayPlayRate;                                                               // 0x9B80 (size: 0x4)
    float IdleSwayAlpha;                                                              // 0x9B84 (size: 0x4)
    float MoveSwayPlayRate;                                                           // 0x9B88 (size: 0x4)

    float PlayEquipMontage(class UAnimMontage* MontageToPlay);
    float PlayFireMontage(class UAnimMontage* MontageToPlay, bool bFireLast, bool bAiming);
    float PlayReloadMontage(class UAnimMontage* MontageToPlay, bool bFullReload);
    float PlayUnEquipMontage(class UAnimMontage* MontageToPlay);
    void StanceTransitions(FPoseLink InPose, FPoseLink WeaponArms, FPoseLink& StanceTransitions);
    void AdditiveLoco(FPoseLink WeaponAnims, FPoseLink& AdditiveLoco);
    void VaultingLayer(FPoseLink input pose, FPoseLink& VaultingLayer);
    void AnimGraph(FPoseLink& AnimGraph);
    void GetMountPosition();
    void GetGripAmount();
    void GetSightRotationOffset();
    void GetSmoothRotation();
    void GetSightPosition(FVector& Positon);
    void PlayCharacterFPPMontage(class UAnimMontage* MontageToPlay, bool bForceDisableAutoBlendOut, float& PlayDuration);
