#ifndef UE4SS_SDK_ABP_HDPlayerCharacter_TP_HPP
#define UE4SS_SDK_ABP_HDPlayerCharacter_TP_HPP

class UABP_HDPlayerCharacter_TP_C : public UHDPlayerCharacterAnimInst_TPP
{
    FPointerToUberGraphFrame UberGraphFrame;                                          // 0x02E0 (size: 0x8)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;     // 0x02E8 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;     // 0x0308 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;     // 0x0328 (size: 0x20)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_19;                         // 0x0348 (size: 0xB8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_45;                         // 0x0400 (size: 0x78)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_35;                                 // 0x0478 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_34;                                 // 0x0580 (size: 0x108)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_4;                            // 0x0688 (size: 0xC8)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_7;                      // 0x0750 (size: 0xC0)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;     // 0x0810 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;     // 0x0830 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_33;                                 // 0x0850 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_32;                                 // 0x0958 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_31;                                 // 0x0A60 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_30;                                 // 0x0B68 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;     // 0x0C70 (size: 0x20)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_2;                                // 0x0C90 (size: 0xC8)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;     // 0x0D58 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;     // 0x0D78 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_13;                                     // 0x0D98 (size: 0xF0)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_6;                      // 0x0E88 (size: 0xC0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_18;                         // 0x0F48 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_29;                           // 0x1000 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_28;                           // 0x1028 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_29;                                 // 0x1050 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_28;                                 // 0x1158 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_12;                                     // 0x1260 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_27;                                 // 0x1350 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_11;                                     // 0x1458 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_26;                                 // 0x1548 (size: 0x108)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_27;                           // 0x1650 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_26;                           // 0x1678 (size: 0x28)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;     // 0x16A0 (size: 0x20)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_10;                                     // 0x16C0 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_25;                                 // 0x17B0 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;     // 0x18B8 (size: 0x20)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_5;                      // 0x18D8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_25;                           // 0x1998 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_7;                        // 0x19C0 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_17;                         // 0x1A60 (size: 0xB8)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_24;                                 // 0x1B18 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_23;                                 // 0x1C20 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_22;                                 // 0x1D28 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_21;                                 // 0x1E30 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_20;                                 // 0x1F38 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_19;                                 // 0x2040 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_18;                                 // 0x2148 (size: 0x108)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_16;                         // 0x2250 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_24;                           // 0x2308 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_23;                           // 0x2330 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_17;                                 // 0x2358 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_16;                                 // 0x2460 (size: 0x108)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;     // 0x2568 (size: 0x20)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;     // 0x2588 (size: 0x20)
    char padding_0[0x8];                                                              // 0x25A8 (size: 0x8)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK_1;                                    // 0x25B0 (size: 0x1E0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_9;                                      // 0x2790 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_8;                                      // 0x2880 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_7;                                      // 0x2970 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_6;                                      // 0x2A60 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_15;                                 // 0x2B50 (size: 0x108)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_105;                    // 0x2C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_104;                    // 0x2C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_103;                    // 0x2CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_102;                    // 0x2CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_101;                    // 0x2CF8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_44;                         // 0x2D20 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_55;                               // 0x2D98 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_43;                         // 0x2DC8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_54;                               // 0x2E40 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_42;                         // 0x2E70 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_53;                               // 0x2EE8 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_IdentityPose_1;                                   // 0x2F18 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_52;                               // 0x2F30 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_12;                             // 0x2F60 (size: 0xB0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_3;                            // 0x3010 (size: 0xC8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_100;                    // 0x30D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_99;                     // 0x3100 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_98;                     // 0x3128 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_41;                         // 0x3150 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_51;                               // 0x31C8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_40;                         // 0x31F8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_50;                               // 0x3270 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_IdentityPose;                                     // 0x32A0 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_49;                               // 0x32B8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_11;                             // 0x32E8 (size: 0xB0)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_2;                            // 0x3398 (size: 0xC8)
    FAnimNode_TwoBoneIK AnimGraphNode_TwoBoneIK;                                      // 0x3460 (size: 0x1E0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_14;                                 // 0x3640 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_13;                                 // 0x3748 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_12;                                 // 0x3850 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_11;                                 // 0x3958 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_4;                      // 0x3A60 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_22;                           // 0x3B20 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_15;                         // 0x3B48 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_21;                           // 0x3C00 (size: 0x28)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_3;                      // 0x3C28 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_20;                           // 0x3CE8 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_5;                                      // 0x3D10 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_4;                                      // 0x3E00 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_10;                                 // 0x3EF0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_9;                                  // 0x3FF8 (size: 0x108)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_3;                                      // 0x4100 (size: 0xF0)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_2;                                      // 0x41F0 (size: 0xF0)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_8;                                  // 0x42E0 (size: 0x108)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_2;                      // 0x43E8 (size: 0xC0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_19;                           // 0x44A8 (size: 0x28)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_7;                                  // 0x44D0 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_6;                                  // 0x45D8 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;     // 0x46E0 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;     // 0x4700 (size: 0x20)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_5;                                  // 0x4720 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_4;                                  // 0x4828 (size: 0x108)
    FAnimNode_Root AnimGraphNode_Root_9;                                              // 0x4930 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose_4;                                   // 0x4960 (size: 0x18)
    FAnimNode_Root AnimGraphNode_Root_8;                                              // 0x4978 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_7;                        // 0x49A8 (size: 0x78)
    FAnimNode_Root AnimGraphNode_Root_7;                                              // 0x4A20 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_6;                        // 0x4A50 (size: 0x78)
    FAnimNode_Root AnimGraphNode_Root_6;                                              // 0x4AC8 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_5;                        // 0x4AF8 (size: 0x78)
    FAnimNode_Root AnimGraphNode_Root_5;                                              // 0x4B70 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_4;                        // 0x4BA0 (size: 0x78)
    FAnimNode_Root AnimGraphNode_Root_4;                                              // 0x4C18 (size: 0x30)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_3;                        // 0x4C48 (size: 0x78)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_2;                        // 0x4CC0 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_14;                         // 0x4D38 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_13;                         // 0x4DF0 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_18;                           // 0x4EA8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_17;                           // 0x4ED0 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone_1;                                      // 0x4EF8 (size: 0xF0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_12;                         // 0x4FE8 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_16;                           // 0x50A0 (size: 0x28)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive_1;                            // 0x50C8 (size: 0xC8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose_1;                        // 0x5190 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_11;                         // 0x5208 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_15;                           // 0x52C0 (size: 0x28)
    FAnimNode_CopyBone AnimGraphNode_CopyBone;                                        // 0x52E8 (size: 0xF0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_14;                           // 0x53D8 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_13;                           // 0x5400 (size: 0x28)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_10;                         // 0x5428 (size: 0xB8)
    FAnimNode_Slot AnimGraphNode_Slot_1;                                              // 0x54E0 (size: 0x48)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_39;                         // 0x5528 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_9;                          // 0x55A0 (size: 0xB8)
    FAnimNode_ApplyAdditive AnimGraphNode_ApplyAdditive;                              // 0x5658 (size: 0xC8)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_38;                         // 0x5720 (size: 0x78)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_4;      // 0x5798 (size: 0x188)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_6;                        // 0x5920 (size: 0xA0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_12;                           // 0x59C0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_37;                         // 0x59E8 (size: 0x78)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_8;                          // 0x5A60 (size: 0xB8)
    FAnimNode_LinkedInputPose AnimGraphNode_LinkedInputPose;                          // 0x5B18 (size: 0x78)
    FAnimNode_Root AnimGraphNode_Root_3;                                              // 0x5B90 (size: 0x30)
    FAnimNode_Root AnimGraphNode_Root_2;                                              // 0x5BC0 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_97;                     // 0x5BF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_96;                     // 0x5C18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_95;                     // 0x5C40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_94;                     // 0x5C68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_93;                     // 0x5C90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_92;                     // 0x5CB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_91;                     // 0x5CE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_90;                     // 0x5D08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_89;                     // 0x5D30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_88;                     // 0x5D58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_87;                     // 0x5D80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_86;                     // 0x5DA8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_36;                         // 0x5DD0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_48;                               // 0x5E48 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_35;                         // 0x5E78 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_47;                               // 0x5EF0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_34;                         // 0x5F20 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_46;                               // 0x5F98 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_33;                         // 0x5FC8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_45;                               // 0x6040 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_32;                         // 0x6070 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_44;                               // 0x60E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_31;                         // 0x6118 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_43;                               // 0x6190 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_30;                         // 0x61C0 (size: 0x78)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_29;                         // 0x6238 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_5;                        // 0x62B0 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_42;                               // 0x6350 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_10;                             // 0x6380 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_41;                               // 0x6430 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_85;                     // 0x6460 (size: 0x28)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose_3;                                   // 0x6488 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_40;                               // 0x64A0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_9;                              // 0x64D0 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_7;                          // 0x6580 (size: 0xB8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_84;                     // 0x6638 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_83;                     // 0x6660 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_82;                     // 0x6688 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_81;                     // 0x66B0 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_28;                         // 0x66D8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_39;                               // 0x6750 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_11;                           // 0x6780 (size: 0x28)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_4;                        // 0x67A8 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_27;                         // 0x6848 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_38;                               // 0x68C0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_26;                         // 0x68F0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_37;                               // 0x6968 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_10;                           // 0x6998 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_36;                               // 0x69C0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_8;                              // 0x69F0 (size: 0xB0)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend_1;                                // 0x6AA0 (size: 0xC8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_9;                            // 0x6B68 (size: 0x28)
    FAnimNode_Root AnimGraphNode_Root_1;                                              // 0x6B90 (size: 0x30)
    FAnimNode_Slot AnimGraphNode_Slot;                                                // 0x6BC0 (size: 0x48)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_80;                     // 0x6C08 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_79;                     // 0x6C30 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_78;                     // 0x6C58 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_77;                     // 0x6C80 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_76;                     // 0x6CA8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_75;                     // 0x6CD0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_74;                     // 0x6CF8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_73;                     // 0x6D20 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_72;                     // 0x6D48 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_71;                     // 0x6D70 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_70;                     // 0x6D98 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_69;                     // 0x6DC0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_68;                     // 0x6DE8 (size: 0x28)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose_2;                                   // 0x6E10 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_35;                               // 0x6E28 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_7;                              // 0x6E58 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_34;                               // 0x6F08 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_67;                     // 0x6F38 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_8;                            // 0x6F60 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_33;                               // 0x6F88 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_66;                     // 0x6FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_65;                     // 0x6FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_64;                     // 0x7008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_63;                     // 0x7030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_62;                     // 0x7058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_61;                     // 0x7080 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_25;                         // 0x70A8 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_3;                        // 0x7120 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_24;                         // 0x71C0 (size: 0x78)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_5;                        // 0x7238 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_23;                         // 0x72E8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_32;                               // 0x7360 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_22;                         // 0x7390 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_2;                        // 0x7408 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_21;                         // 0x74A8 (size: 0x78)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_4;                        // 0x7520 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_20;                         // 0x75D0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_31;                               // 0x7648 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_19;                         // 0x7678 (size: 0x78)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool_1;                        // 0x76F0 (size: 0xA0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_18;                         // 0x7790 (size: 0x78)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_3;                        // 0x7808 (size: 0xB0)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_17;                         // 0x78B8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_30;                               // 0x7930 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose_1;                                   // 0x7960 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_29;                               // 0x7978 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_6;                              // 0x79A8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_28;                               // 0x7A58 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_60;                     // 0x7A88 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_59;                     // 0x7AB0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_58;                     // 0x7AD8 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_16;                         // 0x7B00 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_27;                               // 0x7B78 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_8;                      // 0x7BA8 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_26;                               // 0x7C88 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_5;                              // 0x7CB8 (size: 0xB0)
    FAnimNode_StateResult AnimGraphNode_StateResult_25;                               // 0x7D68 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_7;                            // 0x7D98 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_24;                               // 0x7DC0 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_4;                              // 0x7DF0 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_57;                     // 0x7EA0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_56;                     // 0x7EC8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_55;                     // 0x7EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_54;                     // 0x7F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_53;                     // 0x7F40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_52;                     // 0x7F68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_51;                     // 0x7F90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_50;                     // 0x7FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_49;                     // 0x7FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_48;                     // 0x8008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_47;                     // 0x8030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_46;                     // 0x8058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_45;                     // 0x8080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_44;                     // 0x80A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_43;                     // 0x80D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_42;                     // 0x80F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_41;                     // 0x8120 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_40;                     // 0x8148 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_23;                               // 0x8170 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_6;                            // 0x81A0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_22;                               // 0x81C8 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_21;                               // 0x81F8 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_5;                            // 0x8228 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_20;                               // 0x8250 (size: 0x30)
    FAnimNode_StateResult AnimGraphNode_StateResult_19;                               // 0x8280 (size: 0x30)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_4;                            // 0x82B0 (size: 0x28)
    FAnimNode_StateResult AnimGraphNode_StateResult_18;                               // 0x82D8 (size: 0x30)
    FAnimNode_RefPose AnimGraphNode_LocalRefPose;                                     // 0x8308 (size: 0x18)
    FAnimNode_StateResult AnimGraphNode_StateResult_17;                               // 0x8320 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_3;                              // 0x8350 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_6;                          // 0x8400 (size: 0xB8)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_39;                     // 0x84B8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_38;                     // 0x84E0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_37;                     // 0x8508 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_36;                     // 0x8530 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_35;                     // 0x8558 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_34;                     // 0x8580 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_33;                     // 0x85A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_32;                     // 0x85D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_31;                     // 0x85F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_30;                     // 0x8620 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_29;                     // 0x8648 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_28;                     // 0x8670 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_27;                     // 0x8698 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_26;                     // 0x86C0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_25;                     // 0x86E8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_24;                     // 0x8710 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_23;                     // 0x8738 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_22;                     // 0x8760 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_21;                     // 0x8788 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_20;                     // 0x87B0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_19;                     // 0x87D8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_18;                     // 0x8800 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_15;                         // 0x8828 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_16;                               // 0x88A0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_14;                         // 0x88D0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_15;                               // 0x8948 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_13;                         // 0x8978 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_14;                               // 0x89F0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_12;                         // 0x8A20 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_13;                               // 0x8A98 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_11;                         // 0x8AC8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_12;                               // 0x8B40 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_10;                         // 0x8B70 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_11;                               // 0x8BE8 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_17;                     // 0x8C18 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_9;                          // 0x8C40 (size: 0x78)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_3;                                  // 0x8CB8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_2;                                  // 0x8DC0 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;     // 0x8EC8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;     // 0x8EE8 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_8;                          // 0x8F08 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend_1;                      // 0x8F80 (size: 0xC0)
    FAnimNode_StateResult AnimGraphNode_StateResult_10;                               // 0x9040 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_7;                          // 0x9070 (size: 0x78)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone_1;                                  // 0x90E8 (size: 0x108)
    FAnimNode_ModifyBone AnimGraphNode_ModifyBone;                                    // 0x91F0 (size: 0x108)
    FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;       // 0x92F8 (size: 0x20)
    FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;       // 0x9318 (size: 0x20)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_6;                          // 0x9338 (size: 0x78)
    FAnimNode_LayeredBoneBlend AnimGraphNode_LayeredBoneBlend;                        // 0x93B0 (size: 0xC0)
    FAnimNode_StateResult AnimGraphNode_StateResult_9;                                // 0x9470 (size: 0x30)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_7;                      // 0x94A0 (size: 0xE0)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_3;      // 0x9580 (size: 0x188)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_2;      // 0x9708 (size: 0x188)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_6;                      // 0x9890 (size: 0xE0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_2;                        // 0x9970 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_5;                      // 0x9A20 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_4;                      // 0x9B00 (size: 0xE0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_3;                      // 0x9BE0 (size: 0xE0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum_1;                        // 0x9CC0 (size: 0xB0)
    FAnimNode_BlendListByBool AnimGraphNode_BlendListByBool;                          // 0x9D70 (size: 0xA0)
    FAnimNode_StateResult AnimGraphNode_StateResult_8;                                // 0x9E10 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_2;                              // 0x9E40 (size: 0xB0)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_16;                     // 0x9EF0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_15;                     // 0x9F18 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_14;                     // 0x9F40 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_13;                     // 0x9F68 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_12;                     // 0x9F90 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_11;                     // 0x9FB8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_10;                     // 0x9FE0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_9;                      // 0xA008 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_8;                      // 0xA030 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_7;                      // 0xA058 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_6;                      // 0xA080 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_5;                      // 0xA0A8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_4;                      // 0xA0D0 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_3;                      // 0xA0F8 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_2;                      // 0xA120 (size: 0x28)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult_1;                      // 0xA148 (size: 0x28)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_5;                          // 0xA170 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_7;                                // 0xA1E8 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_4;                          // 0xA218 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_6;                                // 0xA290 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_3;                          // 0xA2C0 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_5;                                // 0xA338 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_2;                          // 0xA368 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_4;                                // 0xA3E0 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer_1;                          // 0xA410 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_3;                                // 0xA488 (size: 0x30)
    FAnimNode_SequencePlayer AnimGraphNode_SequencePlayer;                            // 0xA4B8 (size: 0x78)
    FAnimNode_StateResult AnimGraphNode_StateResult_2;                                // 0xA530 (size: 0x30)
    FAnimNode_TransitionResult AnimGraphNode_TransitionResult;                        // 0xA560 (size: 0x28)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace_1;      // 0xA588 (size: 0x188)
    FAnimNode_RotationOffsetBlendSpace AnimGraphNode_RotationOffsetBlendSpace;        // 0xA710 (size: 0x188)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_2;                      // 0xA898 (size: 0xE0)
    FAnimNode_BlendListByEnum AnimGraphNode_BlendListByEnum;                          // 0xA978 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer_1;                      // 0xAA28 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult_1;                                // 0xAB08 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine_1;                              // 0xAB38 (size: 0xB0)
    FAnimNode_BlendSpacePlayer AnimGraphNode_BlendSpacePlayer;                        // 0xABE8 (size: 0xE0)
    FAnimNode_StateResult AnimGraphNode_StateResult;                                  // 0xACC8 (size: 0x30)
    FAnimNode_StateMachine AnimGraphNode_StateMachine;                                // 0xACF8 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_5;                          // 0xADA8 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_4;                          // 0xAE60 (size: 0xB8)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_3;                          // 0xAF18 (size: 0xB8)
    FAnimNode_Root AnimGraphNode_Root;                                                // 0xAFD0 (size: 0x30)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_6;                        // 0xB000 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_2;                          // 0xB0B0 (size: 0xB8)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_5;                        // 0xB168 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_4;                        // 0xB218 (size: 0xB0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose_1;                          // 0xB2C8 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_3;                            // 0xB380 (size: 0x28)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_3;                        // 0xB3A8 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_2;                        // 0xB458 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer_1;                        // 0xB508 (size: 0xB0)
    FAnimNode_LinkedAnimLayer AnimGraphNode_LinkedAnimLayer;                          // 0xB5B8 (size: 0xB0)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_2;                            // 0xB668 (size: 0x28)
    bool __CustomProperty_DoPelvisDisplacement_E656822F4F77DD47557E8BA0FC4D0E5E;      // 0xB690 (size: 0x1)
    char padding_1[0x3];                                                              // 0xB691 (size: 0x3)
    FVector __CustomProperty_PelvisIK_Displacement_E656822F4F77DD47557E8BA0FC4D0E5E;  // 0xB694 (size: 0xC)
    bool __CustomProperty_bDoFootIK_R_E656822F4F77DD47557E8BA0FC4D0E5E;               // 0xB6A0 (size: 0x1)
    bool __CustomProperty_bDoFootIK_L_E656822F4F77DD47557E8BA0FC4D0E5E;               // 0xB6A1 (size: 0x1)
    char padding_2[0x2];                                                              // 0xB6A2 (size: 0x2)
    FRotator __CustomProperty_FootIK_L_Rotation_E656822F4F77DD47557E8BA0FC4D0E5E;     // 0xB6A4 (size: 0xC)
    FRotator __CustomProperty_FootIK_R_Rotation_E656822F4F77DD47557E8BA0FC4D0E5E;     // 0xB6B0 (size: 0xC)
    FVector __CustomProperty_FootIK_L_Displacement_E656822F4F77DD47557E8BA0FC4D0E5E;  // 0xB6BC (size: 0xC)
    FVector __CustomProperty_FootIK_R_Displacement_E656822F4F77DD47557E8BA0FC4D0E5E;  // 0xB6C8 (size: 0xC)
    bool __CustomProperty_bPreventAOHandDriftFromWeapon_E656822F4F77DD47557E8BA0FC4D0E5E; // 0xB6D4 (size: 0x1)
    char padding_3[0x3];                                                              // 0xB6D5 (size: 0x3)
    float __CustomProperty_HandFKWeight_E656822F4F77DD47557E8BA0FC4D0E5E;             // 0xB6D8 (size: 0x4)
    bool __CustomProperty_bUseHandIKRetargeting_E656822F4F77DD47557E8BA0FC4D0E5E;     // 0xB6DC (size: 0x1)
    bool __CustomProperty_bUseRightHandIK_E656822F4F77DD47557E8BA0FC4D0E5E;           // 0xB6DD (size: 0x1)
    bool __CustomProperty_bUseLeftHandIK_E656822F4F77DD47557E8BA0FC4D0E5E;            // 0xB6DE (size: 0x1)
    char padding_4[0x1];                                                              // 0xB6DF (size: 0x1)
    FTransform __CustomProperty_RightHandIKTransform_E656822F4F77DD47557E8BA0FC4D0E5E; // 0xB6E0 (size: 0x30)
    FTransform __CustomProperty_LeftHandIKTransform_E656822F4F77DD47557E8BA0FC4D0E5E; // 0xB710 (size: 0x30)
    FAnimNode_LinkedAnimGraph AnimGraphNode_LinkedAnimGraph;                          // 0xB740 (size: 0xA0)
    FAnimNode_SaveCachedPose AnimGraphNode_SaveCachedPose;                            // 0xB7E0 (size: 0xB8)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose_1;                            // 0xB898 (size: 0x28)
    FAnimNode_UseCachedPose AnimGraphNode_UseCachedPose;                              // 0xB8C0 (size: 0x28)
    FAnimNode_TwoWayBlend AnimGraphNode_TwoWayBlend;                                  // 0xB8E8 (size: 0xC8)
    class ABP_HDPlayerCharacterBase_C* OwningChar;                                    // 0xB9B0 (size: 0x8)
    class ABP_HDPlayerControllerBase_C* OwningPC;                                     // 0xB9B8 (size: 0x8)
    class ABP_HDWeaponBase_C* CurrentWeapon;                                          // 0xB9C0 (size: 0x8)
    bool bNotLeaningOrIsMoving;                                                       // 0xB9C8 (size: 0x1)
    bool bLeaningNoSpeed;                                                             // 0xB9C9 (size: 0x1)
    bool bLeaningLeft;                                                                // 0xB9CA (size: 0x1)
    bool bLeaningRight;                                                               // 0xB9CB (size: 0x1)
    ELeanDirection LeanDirection;                                                     // 0xB9CC (size: 0x1)
    bool bEquipped;                                                                   // 0xB9CD (size: 0x1)
    bool bValidMovementState;                                                         // 0xB9CE (size: 0x1)
    bool bLandBasedMovement;                                                          // 0xB9CF (size: 0x1)
    bool bFluidBasedMovement;                                                         // 0xB9D0 (size: 0x1)
    bool bAirBasedMovement;                                                           // 0xB9D1 (size: 0x1)
    bool bAirOnlyBasedMovement;                                                       // 0xB9D2 (size: 0x1)
    bool bFiring;                                                                     // 0xB9D3 (size: 0x1)
    float FiringAlpha;                                                                // 0xB9D4 (size: 0x4)
    bool bDisableWeaponUpperBodyLayer;                                                // 0xB9D8 (size: 0x1)
    TEnumAsByte<ECharacterMoveState::Type> MovementState;                             // 0xB9D9 (size: 0x1)
    EItemType EquippedItemType;                                                       // 0xB9DA (size: 0x1)
    bool bPrefiring;                                                                  // 0xB9DB (size: 0x1)
    bool bReadyToThrow;                                                               // 0xB9DC (size: 0x1)
    bool bUseLeftHandIK;                                                              // 0xB9DD (size: 0x1)
    char padding_5[0x2];                                                              // 0xB9DE (size: 0x2)
    FTransform LeftHandIKTransform;                                                   // 0xB9E0 (size: 0x30)
    bool bUseRightHandIK;                                                             // 0xBA10 (size: 0x1)
    char padding_6[0xF];                                                              // 0xBA11 (size: 0xF)
    FTransform RightHandIKTransform;                                                  // 0xBA20 (size: 0x30)
    class UAnimSequenceBase* RifleLeanInAnim;                                         // 0xBA50 (size: 0x8)
    class UAnimSequenceBase* RifleLeanOutAnim;                                        // 0xBA58 (size: 0x8)
    FName WeapLeftHandIKSocketName;                                                   // 0xBA60 (size: 0x8)
    FName WeapRightHandIKSocketName;                                                  // 0xBA68 (size: 0x8)
    FName LeftHandBoneName;                                                           // 0xBA70 (size: 0x8)
    FName RightHandBoneName;                                                          // 0xBA78 (size: 0x8)
    FName LeftFootBoneName;                                                           // 0xBA80 (size: 0x8)
    FName RightFootBoneName;                                                          // 0xBA88 (size: 0x8)
    FTransform WeapDefaultLeftHandIKTransform_Rifle;                                  // 0xBA90 (size: 0x30)
    FTransform WeapDefaultLeftHandIKTransform_Pistol;                                 // 0xBAC0 (size: 0x30)
    FTransform WeapDefaultRightHandIKTransform_Rifle;                                 // 0xBAF0 (size: 0x30)
    FTransform WeapDefaultRightHandIKTransform_Pistol;                                // 0xBB20 (size: 0x30)
    class UAnimSequenceBase* BasePoseUpperAnim;                                       // 0xBB50 (size: 0x8)
    class UAnimSequenceBase* BasePoseTPPUpperAnim;                                    // 0xBB58 (size: 0x8)
    class UAnimSequenceBase* IdleAdditiveUpperAnim;                                   // 0xBB60 (size: 0x8)
    class UAnimSequenceBase* MoveUpperAnim;                                           // 0xBB68 (size: 0x8)
    class UAnimSequenceBase* AimInUpperAnim;                                          // 0xBB70 (size: 0x8)
    class UAnimSequenceBase* AimBasePoseUpperAnim;                                    // 0xBB78 (size: 0x8)
    class UAnimSequenceBase* AimOutUpperAnim;                                         // 0xBB80 (size: 0x8)
    class UAnimSequenceBase* SprintInUpperAnim;                                       // 0xBB88 (size: 0x8)
    class UAnimSequenceBase* SprintUpperAnim;                                         // 0xBB90 (size: 0x8)
    class UAnimSequenceBase* SprintOutUpperAnim;                                      // 0xBB98 (size: 0x8)
    class UAnimSequenceBase* ProneInUpperAnim;                                        // 0xBBA0 (size: 0x8)
    class UAnimSequenceBase* CrawlUpperAnim;                                          // 0xBBA8 (size: 0x8)
    class UAnimSequenceBase* ProneOutUpperAnim;                                       // 0xBBB0 (size: 0x8)
    class UAnimSequenceBase* IdleLowerBodyAnim;                                       // 0xBBB8 (size: 0x8)
    class USkeletalMeshComponent* SourceMesh;                                         // 0xBBC0 (size: 0x8)
    bool bValidProneUpperAnims;                                                       // 0xBBC8 (size: 0x1)
    char padding_7[0x3];                                                              // 0xBBC9 (size: 0x3)
    float IdleUpperBodyAnimPlayRateToUse;                                             // 0xBBCC (size: 0x4)
    bool bUseMirroredLowerBodyLocomotion;                                             // 0xBBD0 (size: 0x1)
    char padding_8[0x3];                                                              // 0xBBD1 (size: 0x3)
    float LowerBodyBSPlayRateToUse;                                                   // 0xBBD4 (size: 0x4)
    float HandFKWeightToUse;                                                          // 0xBBD8 (size: 0x4)
    bool bDebugAnimMontagePlayback;                                                   // 0xBBDC (size: 0x1)
    char padding_9[0x3];                                                              // 0xBBDD (size: 0x3)
    class UAnimMontage* CharAnimMontageToPlay;                                        // 0xBBE0 (size: 0x8)
    TSubclassOf<class UAnimInstance> WeapAnimInstanceToUse;                           // 0xBBE8 (size: 0x8)
    class UAnimMontage* WeapAnimMontageToPlay;                                        // 0xBBF0 (size: 0x8)
    float RifleHandFKWeight;                                                          // 0xBBF8 (size: 0x4)
    float PistolHandFKWeight;                                                         // 0xBBFC (size: 0x4)
    TEnumAsByte<ETraceTypeQuery> FootIKTraceChannel;                                  // 0xBC00 (size: 0x1)
    char padding_10[0x3];                                                             // 0xBC01 (size: 0x3)
    float PawnScale;                                                                  // 0xBC04 (size: 0x4)
    float FootIKTraceDist;                                                            // 0xBC08 (size: 0x4)
    FVector LeftFootIKOffset;                                                         // 0xBC0C (size: 0xC)
    FVector RightFootIKOffset;                                                        // 0xBC18 (size: 0xC)
    char padding_11[0x4];                                                             // 0xBC24 (size: 0x4)
    class UAnimSequenceBase* ThrowReadyBasePoseUpperAnim;                             // 0xBC28 (size: 0x8)
    float LeanAmount;                                                                 // 0xBC30 (size: 0x4)
    float LeanAlpha;                                                                  // 0xBC34 (size: 0x4)
    bool bRifleLean;                                                                  // 0xBC38 (size: 0x1)
    char padding_12[0x3];                                                             // 0xBC39 (size: 0x3)
    float LeanLeftInAnimTime;                                                         // 0xBC3C (size: 0x4)
    float LeanLeftOutAnimTime;                                                        // 0xBC40 (size: 0x4)
    float LeanRightInAnimTime;                                                        // 0xBC44 (size: 0x4)
    float LeanRightOutAnimTime;                                                       // 0xBC48 (size: 0x4)
    float LeanAnimOffset;                                                             // 0xBC4C (size: 0x4)
    bool bStanding;                                                                   // 0xBC50 (size: 0x1)
    bool bInCrouchStance;                                                             // 0xBC51 (size: 0x1)
    bool bInProneStance;                                                              // 0xBC52 (size: 0x1)
    bool bStandToCrouch;                                                              // 0xBC53 (size: 0x1)
    bool bStandToProne;                                                               // 0xBC54 (size: 0x1)
    bool bCrouchToProne;                                                              // 0xBC55 (size: 0x1)
    char padding_13[0x2];                                                             // 0xBC56 (size: 0x2)
    float WeaponUpperBodyAlpha;                                                       // 0xBC58 (size: 0x4)
    float MovementAlpha;                                                              // 0xBC5C (size: 0x4)
    float MovementAmount;                                                             // 0xBC60 (size: 0x4)
    FVector ItemPositionOffset;                                                       // 0xBC64 (size: 0xC)
    float ElbowIKWeight;                                                              // 0xBC70 (size: 0x4)
    char padding_14[0x4];                                                             // 0xBC74 (size: 0x4)
    FCharacterAnimCollection WeapArmsTPPAnims;                                        // 0xBC78 (size: 0x128)
    float AimPitchAlpha;                                                              // 0xBDA0 (size: 0x4)
    FVector AimingOffset;                                                             // 0xBDA4 (size: 0xC)
    float AimAlpha;                                                                   // 0xBDB0 (size: 0x4)
    float DeltaTimeX;                                                                 // 0xBDB4 (size: 0x4)
    FRotator InversePitchAimRot;                                                      // 0xBDB8 (size: 0xC)
    bool bVaulting;                                                                   // 0xBDC4 (size: 0x1)
    bool bNotVaultingNoAir;                                                           // 0xBDC5 (size: 0x1)
    EVaultBehavior VaultBehavior;                                                     // 0xBDC6 (size: 0x1)
    bool bSprintVault;                                                                // 0xBDC7 (size: 0x1)
    bool bVaultOver;                                                                  // 0xBDC8 (size: 0x1)
    bool bClimbOnto;                                                                  // 0xBDC9 (size: 0x1)
    char padding_15[0x2];                                                             // 0xBDCA (size: 0x2)
    FVector VaultPelvisOffset;                                                        // 0xBDCC (size: 0xC)
    float VaultPelvisOffsetAlpha;                                                     // 0xBDD8 (size: 0x4)
    float VaultingAlpha;                                                              // 0xBDDC (size: 0x4)
    bool bInsideVaultState;                                                           // 0xBDE0 (size: 0x1)
    char padding_16[0x3];                                                             // 0xBDE1 (size: 0x3)
    FVector LowReadyOffset;                                                           // 0xBDE4 (size: 0xC)
    FRotator LowReadyRotation;                                                        // 0xBDF0 (size: 0xC)
    bool bADSFireOnly;                                                                // 0xBDFC (size: 0x1)
    bool bPistolEquipped;                                                             // 0xBDFD (size: 0x1)
    bool bLowReady;                                                                   // 0xBDFE (size: 0x1)
    char padding_17[0x1];                                                             // 0xBDFF (size: 0x1)
    FRotator SpineLowerAimPitch;                                                      // 0xBE00 (size: 0xC)
    FRotator SpineUpperAimPitch;                                                      // 0xBE0C (size: 0xC)
    FRotator NeckAimPitch;                                                            // 0xBE18 (size: 0xC)
    FRotator HeadAimPitch;                                                            // 0xBE24 (size: 0xC)
    FRotator GunAimPitch;                                                             // 0xBE30 (size: 0xC)
    bool FullBodyFKWeight;                                                            // 0xBE3C (size: 0x1)
    bool bProneMoving;                                                                // 0xBE3D (size: 0x1)
    bool bPistolEquippedAndSprinting;                                                 // 0xBE3E (size: 0x1)
    bool bBagEquipped;                                                                // 0xBE3F (size: 0x1)
    FVector GunAimPitchOffset;                                                        // 0xBE40 (size: 0xC)
    bool bDoPitchRotation;                                                            // 0xBE4C (size: 0x1)
    bool bPistolEquippedAndCrawling;                                                  // 0xBE4D (size: 0x1)
    bool bThrowableEquipped;                                                          // 0xBE4E (size: 0x1)
    bool bStandingMovingAndLowReady;                                                  // 0xBE4F (size: 0x1)
    FRotator PelvisSurfaceNormalRot;                                                  // 0xBE50 (size: 0xC)
    FRotator PelvisSurfaceNormalRotInverse;                                           // 0xBE5C (size: 0xC)
    FVector FootIK_L_Displacement;                                                    // 0xBE68 (size: 0xC)
    FVector FootIK_R_Displacement;                                                    // 0xBE74 (size: 0xC)
    FRotator Foot_IK_R_Rotation;                                                      // 0xBE80 (size: 0xC)
    FRotator Foot_IK_L_Rotation;                                                      // 0xBE8C (size: 0xC)
    bool bDoFootIK_L;                                                                 // 0xBE98 (size: 0x1)
    bool bDoFootIK_R;                                                                 // 0xBE99 (size: 0x1)
    char padding_18[0x2];                                                             // 0xBE9A (size: 0x2)
    FVector PelvisIK_Displacement;                                                    // 0xBE9C (size: 0xC)
    bool bDoPelvisDisplacement;                                                       // 0xBEA8 (size: 0x1)
    bool bSingleAction;                                                               // 0xBEA9 (size: 0x1)
    bool bFiringAndNotSingleAction;                                                   // 0xBEAA (size: 0x1)
    bool bStandingMoving;                                                             // 0xBEAB (size: 0x1)
    float CapsuleQuarterHeight;                                                       // 0xBEAC (size: 0x4)
    float SprintFKAlpha;                                                              // 0xBEB0 (size: 0x4)
    float SprintAlpha;                                                                // 0xBEB4 (size: 0x4)
    float SprintImpulseAlpha;                                                         // 0xBEB8 (size: 0x4)
    FRotator SprintImpulseRotator;                                                    // 0xBEBC (size: 0xC)
    FRotator SprintImpulseRotatorInverse;                                             // 0xBEC8 (size: 0xC)
    float CrouchLeaningLeft;                                                          // 0xBED4 (size: 0x4)

    float PlayEquipMontage(class UAnimMontage* MontageToPlay);
    float PlayFireMontage(class UAnimMontage* MontageToPlay, bool bFireLast, bool bAiming);
    float PlayReloadMontage(class UAnimMontage* MontageToPlay, bool bFullReload);
    float PlayUnEquipMontage(class UAnimMontage* MontageToPlay);
    void WeaponUpperBody(FPoseLink UpperBody, FPoseLink& WeaponUpperBody);
    void WeaponAdditive(FPoseLink& WeaponAdditive);
    void WeaponIdle/Move(FPoseLink LowerIdle/Move, FPoseLink& WeaponIdle/Move);
    void WeaponJumpLoop(FPoseLink LowerJumpLoop, FPoseLink& WeaponJumpLoop);
    void VehicleFullBody(FPoseLink FullBody, FPoseLink& VehicleFullBody);
    void VehicleLowerBody(FPoseLink LowerBody, FPoseLink& VehicleLowerBody);
    void LayeredLoco(FPoseLink InBaseLayer, FPoseLink InOverlayLayer, FPoseLink InFullBodyAdditive, FPoseLink& LayeredLoco);
