#ifndef UE4SS_SDK_BP_HDKitPickup_Medic_Blue_HPP
#define UE4SS_SDK_BP_HDKitPickup_Medic_Blue_HPP

class ABP_HDKitPickup_Medic_Blue_C : public ABP_HDKitPickupBase_C
{
    class UStaticMeshComponent* SM_M16A2_P;                                           // 0x0280 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage7;                                          // 0x0288 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage6;                                          // 0x0290 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage5;                                          // 0x0298 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage4;                                          // 0x02A0 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage3;                                          // 0x02A8 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage2;                                          // 0x02B0 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage1;                                          // 0x02B8 (size: 0x8)
    class UStaticMeshComponent* SM_Bandage;                                           // 0x02C0 (size: 0x8)

}; // Size: 0x2C8

#endif
