#ifndef UE4SS_SDK_FSelectionItemTextStyle_HPP
#define UE4SS_SDK_FSelectionItemTextStyle_HPP

struct FFSelectionItemTextStyle
{
    FMargin Padding_26_17AFF41C417FC693663F8081EB52D726;                              // 0x0000 (size: 0x10)
    FSlateColor ColorandOpacity_4_20D5D4464C0BB2BC34C2F3B10914C7AE;                   // 0x0010 (size: 0x28)
    FSlateFontInfo Font_7_A4528CE546AFE5B4DFD6859748A92965;                           // 0x0038 (size: 0x50)
    FSlateBrush StrikeBrush_11_2C20965947C748A26533E8AE7DC7AECC;                      // 0x0088 (size: 0x88)
    FVector2D ShadowOffset_14_4C0258B24BBB912A29BDBB83ABAF8701;                       // 0x0110 (size: 0x8)
    FLinearColor ShadowColor_17_07A20E594A9C4EB4B2044D99F688B9D7;                     // 0x0118 (size: 0x10)
    float MinDesiredWidth_20_C0C21A794DCD3081AE397991D256873C;                        // 0x0128 (size: 0x4)
    TEnumAsByte<ETextJustify::Type> Justification_23_04F4E0E043FECFD3E28E98A7F00BFFD3; // 0x012C (size: 0x1)

}; // Size: 0x12D

#endif
